In [1]:
import warnings
warnings.simplefilter('ignore')

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn import linear_model

In [15]:
df = pd.read_csv('./competition_data.csv')

In [16]:
df.head()

,id,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,y
0,0,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,1,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,2,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,3,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
4,4,50000,1,1,2,37,0,0,0,0,...,19394,19619,20024,2500,1815,657,1000,1000,800,0

In [17]:
df.shape

(27000, 25)

In [18]:
df = df[["id", "X17", "X16", "X15", "X14", "X13", "X12"]]

In [19]:
df.shape

(27000, 7)

In [20]:
df.head()

   id    X17    X16    X15    X14    X13    X12
0   0      0      0      0    689   3102   3913
1   1   3261   3455   3272   2682   1725   2682
2   2  15549  14948  14331  13559  14027  29239
3   3  19131  19146  20940  35835   5670   8617
4   4  20024  19619  19394  57608  57069  64400

In [21]:
df = df.rename(columns={'X17': '1', 'X16': '2', 'X15' : '3', 'X14':'4', 'X13':'5', 'X12':'6'})

In [22]:
df.head()

   id      1      2      3      4      5      6
0   0      0      0      0    689   3102   3913
1   1   3261   3455   3272   2682   1725   2682
2   2  15549  14948  14331  13559  14027  29239
3   3  19131  19146  20940  35835   5670   8617
4   4  20024  19619  19394  57608  57069  64400

In [23]:
df = df.iloc[1:6,:]

In [24]:
df

   id       1       2       3       4       5       6
1   1    3261    3455    3272    2682    1725    2682
2   2   15549   14948   14331   13559   14027   29239
3   3   19131   19146   20940   35835    5670    8617
4   4   20024   19619   19394   57608   57069   64400
5   5  473944  483003  542653  445007  412023  367965

In [12]:
for i in range(0, 5):
    print(i)

0
1
2
3
4